# Date and Time Functions

## Date and Time Data Types

In [2]:
DATE;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'DATE' at line 1

In [3]:
TIME;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'TIME' at line 1

In [4]:
DATETIME;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'DATETIME' at line 1

In [5]:
TIMESTAMP;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'TIMESTAMP' at line 1

In [6]:
YEAR;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'YEAR' at line 1

## Current Date and Time

In [7]:
SELECT NOW( );

In [9]:
USE rookery;

In [10]:
INSERT INTO bird_sightings
(bird_id, human_id, time_seen, location_gps)
VALUES (104, 34, NOW( ), '47.318875; 8.580119');

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

In [11]:
SELECT NOW(), SLEEP(4) AS 'Zzz', SYSDATE(), SLEEP(2) AS 'Zzz', SYSDATE();

In [12]:
SELECT NOW( ), CURDATE( ), CURTIME( );

In [13]:
SELECT UNIX_TIMESTAMP( ), NOW( );

In [14]:
SELECT (2014 - 1970) AS 'Simple',
UNIX_TIMESTAMP( ) AS 'Seconds since Epoch',
ROUND(UNIX_TIMESTAMP( ) / 60 / 60 / 24 / 365.25) AS 'Complicated';

In [15]:
SELECT CONCAT(name_first, SPACE(1), name_last) AS 'Birdwatcher',
ROUND((UNIX_TIMESTAMP( ) - UNIX_TIMESTAMP(time_seen)) / 60 / 60 / 24)
 AS 'Days Since Spotted'
FROM bird_sightings JOIN humans USING(human_id)
WHERE bird_id = 309;

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

## Extracting Date and Time Components

In [18]:
SELECT CONCAT(name_first, SPACE(1), name_last) AS 'Birdwatcher',
time_seen, DATE(time_seen), TIME(time_seen)
FROM bird_sightings
JOIN humans USING(human_id)
WHERE bird_id = 309;

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

In [19]:
SELECT CONCAT(name_first, SPACE(1), name_last) AS 'Birdwatcher',
time_seen, HOUR(time_seen), MINUTE(time_seen), SECOND(time_seen)
FROM bird_sightings JOIN humans USING(human_id)
WHERE bird_id = 309;

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

In [20]:
SELECT time_seen,
EXTRACT(YEAR_MONTH FROM time_seen) AS 'Year & Month',
EXTRACT(MONTH FROM time_seen) AS 'Month Only',
EXTRACT(HOUR_MINUTE FROM time_seen) AS 'Hour & Minute',
EXTRACT(HOUR FROM time_seen) AS 'Hour Only'
FROM bird_sightings JOIN humans USING(human_id)
LIMIT 3;

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

In [21]:
SELECT common_name AS 'Endangered Bird',
CONCAT(name_first, SPACE(1), name_last) AS 'Birdwatcher',
DATE_FORMAT(time_seen, '%W, %M %e, %Y') AS 'Date Spotted',
TIME_FORMAT(time_seen, '%l:%i %p') AS 'Time Spotted'
FROM bird_sightings
JOIN humans USING(human_id)
JOIN rookery.birds USING(bird_id)
JOIN rookery.conservation_status USING(conservation_status_id)
WHERE conservation_category = 'Threatened' LIMIT 3;

ERROR 1146 (42S02): Table 'rookery.bird_sightings' doesn't exist

## Summary

We’ve covered almost all of the date and time functions in MySQL and MariaDB in this
chapter. There are only a few more. We skipped the aliases (e.g., ADDDATE( ) for
DATE_ADD( ), SUBDATE( ) for DATE_SUB( )). There are also a few other functions for
specialized needs, which you can learn as you need them. You’ve learned plenty in this
chapter, and the information here should come in handy for many years.
The primary reason we went through so many date and time functions is because the
date and time is a major part of most cultures: when something has happened, when
something will happen, making appointments, and how much time has passed are
common concerns when people interact with one another. This information is therefore
a significant component of a database. I want you to be familiar with the temporal
functions and to have a firm grasp on what tools are available. To that end, work through
the exercises in the following section. You’ll retain more of what you learned in this
chapter if you do.